[Killed] StringLiteral
main/components/Reviews/ReviewsTable.jsx:61:17
   const columns = [
     {
       Header: "Moderation Status",
-      accessor: "status",
+      accessor: "",
       Cell: ({ value }) => value,
     },
killedBy: ReviewsTable tests Has the base column headers and content
statusReason: Unable to find an element by: [data-testid="Reviewstable-cell-row-0-col-status"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
