[Killed] BlockStatement
src/main/pages/HomePage.jsx:19:27
 
   const queries = [];
   if (Array.isArray(data)) {
-    for (const d of data) {
-      queries.push({
-        queryKey: ["meals", d.code, date],
-        queryFn: () =>
-          axios
-            .get(`/api/diningcommons/${date}/${d.code}`)
-            .then((res) => res.data),
-      });
-    }
+    for (const d of data) {}
   }
   const mealsOffered = useQueries(queries);
killedBy: HomePage meals offered today tests Query key must be 'meals'
statusReason: expected 0 to be greater than 0
