[Killed] ArrayDeclaration
src/main/pages/HomePage.jsx:12:5
     // Stryker disable next-line all : don't test internal caching of React Query
     [`/api/dining/all`],
     { method: "GET", url: "/api/dining/all" },
-    [],
+    ["Stryker was here"],
   );
 
killedBy: HomePage renders properly with no backend Renders without crashing with no backend
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td
  data-testid="DiningCommonsTable-cell-row-0-col-code"
  role="cell"
>
  <a
    data-discover="true"

[Killed] BlockStatement
src/main/pages/HomePage.jsx:18:28
   const date = new Date().toISOString().split("T")[0];
 
   const queries = [];
-  if (Array.isArray(data)) {
-    for (const d of data) {
-      queries.push({
-        queryKey: ["meals", d.code, date],
-        queryFn: () =>
-          axios
-            .get(`/api/diningcommons/${date}/${d.code}`)
-            .then((res) => res.data),
-      });
-    }
-  }
+  if (Array.isArray(data)) {}
   const mealsOffered = useQueries(queries);
 
killedBy: HomePage meals offered today tests Query key must be 'meals'
statusReason: expected 0 to be greater than 0

[Killed] ArrowFunction
src/main/pages/HomePage.jsx:22:18
     for (const d of data) {
       queries.push({
         queryKey: ["meals", d.code, date],
-        queryFn: () =>
-          axios
-            .get(`/api/diningcommons/${date}/${d.code}`)
-            .then((res) => res.data),
+        queryFn: () => undefined,
       });
     }
killedBy: HomePage meals offered today tests Renders correctly with mealsOfferedToday
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Breakfast
Received:
  No meals offered today

Ignored nodes: comments, script, style

[Survived] ArrayDeclaration
src/main/pages/HomePage.jsx:36:7
         ...d,
         mealsOfferedToday: mealsOffered[i]?.data ?? [],
       }))
-    : [];
+    : ["Stryker was here"];
 
   return (
