[Killed] BlockStatement
src/main/pages/HomePage.jsx:19:31
   const date = new Date().toISOString().split("T")[0];
   const [selectedDate, setSelectedDate] = useState(date);
 
-  const onChangeDate = (e) => {
-    const newDate = e.target.value;
-    setSelectedDate(newDate);
-  };
+  const onChangeDate = (e) => {};
   const queries = [];
   if (Array.isArray(data)) {
killedBy: HomePage tests Renders table with 4 dining commons
statusReason: expect(element).toHaveAttribute("href", "/diningcommons/2025-08-16/carrillo") // element.getAttribute("href") === "/diningcommons/2025-08-16/carrillo"

Expected the element to have attribute:
  href="/diningcommons/2025-08-16/carrillo"
Received:
  href="/diningcommons/2025-03-11/carrillo"

[Killed] ArrowFunction
src/main/pages/HomePage.jsx:28:18
     for (const d of data) {
       queries.push({
         queryKey: ["meals", d.code, selectedDate],
-        queryFn: () =>
-          axios
-            .get(`/api/diningcommons/${selectedDate}/${d.code}`)
-            .then((res) => res.data),
+        queryFn: () => undefined,
       });
     }
killedBy: HomePage meals offered today tests Renders correctly with mealsOfferedToday
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Breakfast
Received:
  No meals offered today

Ignored nodes: comments, script, style
