[Killed] ArrowFunction
src/main/utils/Aliases.jsx:13:40
   },
 });
 
-export const cellToAxiosParamsReject = (cell) => ({
-  method: "PUT",
-  url: "/api/currentUser/updateAliasModeration",
-  params: {
-    id: cell.row.original.id,
-    approved: false,
-    proposedAlias: cell.row.original.proposedAlias,
-  },
-});
+export const cellToAxiosParamsReject = () => undefined;
 
 export function onModerateSuccess() {
killedBy: Aliases Utils cellToAxiosParamsReject returns the correct params for REJECTED
statusReason: expected undefined to deeply equal { …(3) }
