[Killed] MethodExpression
main/components/AliasApproval/AliasApprovalTable.jsx:23:13
 
   return (
     <OurTable
-      data={aliases.filter((user) => user.status === "AWAITING_REVIEW")}
+      data={aliases}
       columns={columns}
       testid={testid}
killedBy: AliasApprovalTable tests renders a data row for each user
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td
  data-testid="Aliasapprovaltable-cell-row-1-col-proposedAlias"
  role="cell"
/> instead
