[Killed] ArrowFunction
main/components/MenuItem/MenuItemTable.jsx:23:9
       return "No reviews";
     const validRatings = reviews
       .filter(
-        (r) => r && typeof r === "object" && typeof r.itemsStars === "number",
+        () => undefined,
       )
       .map((r) => r.itemsStars);
killedBy: MenuItemTable Tests Renders 5 Menu Items Correctly with ratings
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  4.5
Received:
  No ratings

[Killed] ConditionalExpression
main/components/MenuItem/MenuItemTable.jsx:23:16
       return "No reviews";
     const validRatings = reviews
       .filter(
-        (r) => r && typeof r === "object" && typeof r.itemsStars === "number",
+        (r) => true,
       )
       .map((r) => r.itemsStars);
killedBy: MenuItemTable Tests calculateAverageRating handles edge cases correctly
statusReason: Cannot read properties of null (reading 'itemsStars')
