[Killed] LogicalOperator
src/main/pages/ModeratePage.jsx:23:5
   );
 
   const moderatorOptions =
-    hasRole(currentUser, "ROLE_ADMIN") ||
-    hasRole(currentUser, "ROLE_MODERATOR");
+    hasRole(currentUser, "ROLE_ADMIN") && hasRole(currentUser, "ROLE_MODERATOR");
 
   return (
killedBy: Moderate Page Tests renders reviews with approve/reject buttons for moderator
statusReason: Unable to find an element by: [data-testid="Reviewstable-cell-row-0-col-Approve-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
